INSERT INTO Menu (name_) 
VALUES ('---  Меню  ---');


INSERT INTO Category (name_) 
VALUES 
    ('Закуски'), 
    ('Салати'), 
    ('Перші страви'), 
    ('Мʼясні страви'), 
    ('Рибні страви'), 
    ('Гарніри'), 
    ('Десерти'), 
    ('Напої');


INSERT INTO Table_ (num, status, places) 
VALUES 
    (1, 'Вільний', 4), (2, 'Вільний', 4), (3, 'Вільний', 4), (4, 'Вільний', 4), (5, 'Вільний', 4),
    (6, 'Вільний', 4), (7, 'Вільний', 4), (8, 'Вільний', 4), (9, 'Вільний', 4), (10, 'Вільний', 4),
    (11, 'Вільний', 4), (12, 'Вільний', 4), (13, 'Вільний', 4), (14, 'Вільний', 4), (15, 'Вільний', 4),
    (16, 'Вільний', 4), (17, 'Вільний', 4), (18, 'Вільний', 4), (19, 'Вільний', 4), (20, 'Вільний', 4),
    (21, 'Вільний', 4), (22, 'Вільний', 4), (23, 'Вільний', 4), (24, 'Вільний', 4), (25, 'Вільний', 4),
    (26, 'Вільний', 4), (27, 'Вільний', 4), (28, 'Вільний', 4), (29, 'Вільний', 4), (30, 'Вільний', 4);


INSERT INTO Personnel (fullname, position_, phone, is_active, priority_, salary) 
VALUES 
    ('Коваленко Олена', 'Менеджер', '+380501112233', TRUE, 10, 35000.00),
    ('Шевченко Дмитро', 'Менеджер', '+380671112233', TRUE, 10, 35000.00),


    ('Бойко Андрій', 'Шеф-кухар', '+380631112233', TRUE, 8, 45000.00),
    ('Ткаченко Ігор', 'Су-шеф', '+380991112233', TRUE, 7, 35000.00),
    ('Кравченко Василь', 'Кухар гарячого цеху', '+380981112233', TRUE, 5, 28000.00),
    ('Мороз Олег', 'Кухар гарячого цеху', '+380971112233', TRUE, 5, 28000.00),
    ('Лисенко Анна', 'Кухар холодного цеху', '+380961112233', TRUE, 5, 25000.00),
    ('Мельник Ольга', 'Кухар холодного цеху', '+380951112233', TRUE, 5, 25000.00),
    ('Поліщук Іван', 'Кондитер', '+380941112233', TRUE, 6, 30000.00),
    

    ('Григоренко Марія', 'Офіціант', '+380931112233', TRUE, 5, 15000.00),
    ('Павленко Максим', 'Офіціант', '+380921112233', TRUE, 5, 15000.00),
    ('Сидоренко Аліна', 'Офіціант', '+380911112233', TRUE, 5, 15000.00),
    ('Романенко Сергій', 'Офіціант', '+380901112233', TRUE, 5, 15000.00),
    ('Бондар Катерина', 'Офіціант', '+380891112233', TRUE, 5, 15000.00);


INSERT INTO Dish (id_category, name_, price) 
VALUES 
    (1, 'Мʼясне плато', 450.00),
    (1, 'Сирна тарілка з медом і горіхами', 380.00),
    (1, 'Брускети з лососем', 220.00),
    (1, 'Тартар з яловичини', 290.00),
    

    (2, 'Цезар з куркою', 240.00),
    (2, 'Цезар з креветками', 310.00),
    (2, 'Грецький салат', 190.00),
    (2, 'Теплий салат з телятиною', 280.00),
    

    (3, 'Український борщ з пампушками', 160.00),
    (3, 'Мʼясна збірна солянка', 180.00),
    (3, 'Грибний крем-суп', 150.00),
    (3, 'Курячий бульйон з перепелиним яйцем', 120.00),
    

    (4, 'Стейк Рибай', 850.00),
    (4, 'Свинячі реберця BBQ', 420.00),
    (4, 'Медальйони з телятини під ягідним соусом', 550.00),
    (4, 'Качина грудка з яблуками', 480.00),
    

    (5, 'Стейк із лосося на грилі', 620.00),
    (5, 'Дорадо запечена з травами', 540.00),
    (5, 'Сібас на грилі', 540.00),
    

    (6, 'Картопля по-селянськи', 90.00),
    (6, 'Овочі гриль', 160.00),
    (6, 'Картопляне пюре', 70.00),
    (6, 'Дикий рис', 110.00),
    

    (7, 'Класичний Тірамісу', 160.00),
    (7, 'Чизкейк Нью-Йорк', 150.00),
    (7, 'Шоколадний фондан з морозивом', 180.00),
    

    (8, 'Еспресо', 50.00),
    (8, 'Капучино', 70.00),
    (8, 'Лимонад Цитрусовий (1л)', 180.00),
    (8, 'Чай зелений з жасмином', 90.00);


INSERT INTO MenuDish (id_menu, id_dish) 
VALUES 
    (1, 1), (1, 2), (1, 3), (1, 4), (1, 5),
    (1, 6), (1, 7), (1, 8), (1, 9), (1, 10),
    (1, 11), (1, 12), (1, 13), (1, 14), (1, 15),
    (1, 16), (1, 17), (1, 18), (1, 19), (1, 20),
    (1, 21), (1, 22), (1, 23), (1, 24), (1, 25),
    (1, 26), (1, 27), (1, 28), (1, 29), (1, 30);